Конфигурация/src/Documents/ПриходДенег/ПриходДенег.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриходДенег</name>
  <registerRecords>AccumulationRegister.ОстаткиДенег</registerRecords>
  <registerRecords>AccumulationRegister.ОборотыДенег</registerRecords>
  <attributes>
    <name>Кошелек</name>
    <type>
      <types>CatalogRef.Кошельки</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>СтатьяДвижения</name>
      <type>
        <types>CatalogRef.ДвиженияДенег</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Конфигурация/src/AccumulationRegisters/ОстаткиДенег/ОстаткиДенег.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиДенег</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Кошелек</name>
    <type>
      <types>CatalogRef.Кошельки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяДвижения</name>
    <type>
      <types>CatalogRef.ДвиженияДенег</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидСтатьиДвижения</name>
    <type>
      <types>EnumRef.ВидыСтатейДвижения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Конфигурация/src/AccumulationRegisters/ОборотыДенег/ОборотыДенег.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОборотыДенег</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Кошелек</name>
    <type>
      <types>CatalogRef.Кошельки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяДвижения</name>
    <type>
      <types>CatalogRef.ДвиженияДенег</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидСтатьиДвижения</name>
    <type>
      <types>EnumRef.ВидыСтатейДвижения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Конфигурация/src/Enums/ВидыСтатейДвижения/ВидыСтатейДвижения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыСтатейДвижения</name>
  <enumValues>
    <name>Доход</name>
  </enumValues>
  <enumValues>
    <name>Расход</name>
  </enumValues>
</mdclass:Enum>

Конфигурация/src/Documents/ПриходДенег/ObjectModule.bsl
// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

//#Область ОписаниеПеременных
//
//#КонецОбласти

//#Область ПрограммныйИнтерфейс
//
//#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)

	Движения.ОстаткиДенег.Записывать = Истина;
	Движения.ОборотыДенег.Записывать = Истина;
	
	Для Каждого ТекСтрока из ТабличнаяЧасть Цикл
		
		// регистр ОстаткиДенег
		ДвижениеОстаткиДенег = Движения.ОстаткиДенег.ДобавитьПриход();
		ДвижениеОстаткиДенег.Период = Дата;
		ДвижениеОстаткиДенег.Кошелек = Кошелек;
		ДвижениеОстаткиДенег.СтатьяДвижения = ТекСтрока.СтатьяДвижения;
		ДвижениеОстаткиДенег.ВидСтатьиДвижения = Перечисления.ВидыСтатейДвижения.Доход;
		ДвижениеОстаткиДенег.Сумма = ТекСтрока.Сумма;
		
		// регистр ОборотыДенег
		ДвижениеОборотыДенег = Движения.ОборотыДенег.Добавить();
		ДвижениеОборотыДенег.Период = Дата;
		ДвижениеОборотыДенег.Кошелек = Кошелек;
		ДвижениеОборотыДенег.СтатьяДвижения = ТекСтрока.СтатьяДвижения;
		ДвижениеОборотыДенег.ВидСтатьиДвижения = Перечисления.ВидыСтатейДвижения.Доход;
		ДвижениеОборотыДенег.Сумма = ТекСтрока.Сумма;
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

//#Область СлужебныйПрограммныйИнтерфейс
//
//#КонецОбласти

//#Область СлужебныеПроцедурыИФункции
//
//#КонецОбласти

//#Область Инициализация
//
//#КонецОбласти

#КонецЕсли
